# GetTransform Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalElement..::..GetTransform Method
AnalyticalElement Class See Also
---
Returns the transform which reflects Analytical Element orientation.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public Transform GetTransform()
```

Visual Basic
---
```text
Public Function GetTransform As Transform
```

Visual C++
---
```text
public:
Transform^ GetTransform()
```

# ### Return Value
The orientation of the Analytical Element.
# See Also
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace